exilaus/E4d-box-project/SW/working firmware/Marlin/src/HAL/HAL_ESP32/http_ESP32.cpp
#ifdef ARDUINO_ARCH_ESP32

#include "../../inc/MarlinConfigPre.h"

#if ENABLED(WIFISUPPORT)

#include "../../gcode/gcode.h"
#include "../../gcode/queue.h"
#include "../../gcode/parser.h"
#include "../../inc/Version.h"
#include "HAL.h"
#include <WiFi.h>
#include <Preferences.h>
#include "../../core/serial.h"
#include <StreamString.h>
#include <ESPAsyncWebServer.h>
#include <AsyncTCP.h>
#include <ESPmDNS.h>
#include "ESP32SSDP.h"
#include <FS.h>
#include <SPIFFS.h>
#include <Update.h>
#include <esp_wifi.h>
#include <esp_wifi_types.h>
#include "wifi_ESP32.h"
#include "sd_ESP32.h"
#include "ws_ESP32.h"
//embedded response file if no files on SPIFFS
#include "nofile.h"

extern void ESP_wait(uint32_t milliseconds);
typedef enum {
    UPLOAD_STATUS_NONE = 0,
    UPLOAD_STATUS_FAILED = 1,
    UPLOAD_STATUS_CANCELLED = 2,
    UPLOAD_STATUS_SUCCESSFUL = 3,
    UPLOAD_STATUS_ONGOING  = 4
} upload_status_type;

typedef enum {
    LEVEL_GUEST = 0,
    LEVEL_USER = 1,
    LEVEL_ADMIN = 2
} level_authenticate_type;

extern Preferences ESP_preferences;
AsyncWebServer * webserver = NULL;
uint16_t http_port = 0;
uint16_t data_port = 0;
String http_hostname;
uint8_t _upload_status = UPLOAD_STATUS_NONE;
long id_connection = 0;
AsyncWebSocket * web_socket = NULL;
AsyncEventSource * web_events = NULL;

//Default 404
const uint8_t PAGE_404 [] PROGMEM = "<HTML>\n<HEAD>\n<title>Redirecting...</title> \n</HEAD>\n<BODY>\n<CENTER>Unknown page : $QUERY$- you will be redirected...\n<BR><BR>\nif not redirected, <a href='http://$WEB_ADDRESS$'>click here</a>\n<BR><BR>\n<PROGRESS name='prg' id='prg'></PROGRESS>\n\n<script>\nvar i = 0; \nvar x = document.getElementById(\"prg\"); \nx.max=5; \nvar interval=setInterval(function(){\ni=i+1; \nvar x = document.getElementById(\"prg\"); \nx.value=i; \nif (i>5) \n{\nclearInterval(interval);\nwindow.location.href='/';\n}\n},1000);\n</script>\n</CENTER>\n</BODY>\n</HTML>\n\n";

//Helpers

//just simple helper to convert mac address to string
char * mac2str (uint8_t mac [8])
{
    static char macstr [18];
    if (0 > sprintf (macstr, "%02X:%02X:%02X:%02X:%02X:%02X", mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]) ) {
        strcpy (macstr, "00:00:00:00:00:00");
    }
    return macstr;
}

String get_Splited_Value(String data, char separator, int index)
{
  int found = 0;
  int strIndex[] = {0, -1};
  int maxIndex = data.length()-1;

  for(int i=0; i<=maxIndex && found<=index; i++){
    if(data.charAt(i)==separator || i==maxIndex){
        found++;
        strIndex[0] = strIndex[1]+1;
        strIndex[1] = (i == maxIndex) ? i+1 : i;
    }
  }

  return found>index ? data.substring(strIndex[0], strIndex[1]) : "";
}


//helper to format size to readable string
String formatBytes (uint32_t bytes)
{
    if (bytes < 1024) {
        return String (bytes) + " B";
    } else if (bytes < (1024 * 1024) ) {
        return String (bytes / 1024.0) + " KB";
    } else if (bytes < (1024 * 1024 * 1024) ) {
        return String (bytes / 1024.0 / 1024.0) + " MB";
    } else {
        return String (bytes / 1024.0 / 1024.0 / 1024.0) + " GB";
    }
}

//helper to extract content type from file extension
//Check what is the content tye according extension file
String getContentType (String filename)
{
    if (filename.endsWith (".htm") ) {
        return "text/html";
    } else if (filename.endsWith (".html") ) {
        return "text/html";
    } else if (filename.endsWith (".css") ) {
        return "text/css";
    } else if (filename.endsWith (".js") ) {
        return "application/javascript";
    } else if (filename.endsWith (".png") ) {
        return "image/png";
    } else if (filename.endsWith (".gif") ) {
        return "image/gif";
    } else if (filename.endsWith (".jpeg") ) {
        return "image/jpeg";
    } else if (filename.endsWith (".jpg") ) {
        return "image/jpeg";
    } else if (filename.endsWith (".ico") ) {
        return "image/x-icon";
    } else if (filename.endsWith (".xml") ) {
        return "text/xml";
    } else if (filename.endsWith (".pdf") ) {
        return "application/x-pdf";
    } else if (filename.endsWith (".zip") ) {
        return "application/x-zip";
    } else if (filename.endsWith (".gz") ) {
        return "application/x-gzip";
    } else if (filename.endsWith (".txt") ) {
        return "text/plain";
    }
    return "application/octet-stream";
}

//check authentification
level_authenticate_type  is_authenticated()
{
#ifdef AUTHENTICATION_FEATURE
    /*if (web_server.hasHeader ("Cookie") ) {
        String cookie = web_server.header ("Cookie");
        int pos = cookie.indexOf ("ESPSESSIONID=");
        if (pos != -1) {
            int pos2 = cookie.indexOf (";", pos);
            String sessionID = cookie.substring (pos + strlen ("ESPSESSIONID="), pos2);
            IPAddress ip = web_server.client().remoteIP();
            //check if cookie can be reset and clean table in same time
            return ResetAuthIP (ip, sessionID.c_str() );
        }
    }
    return LEVEL_GUEST;*/
#else
    return LEVEL_ADMIN;
#endif
}

String get_param (String & cmd_params, const char * id, bool withspace)
{
    static String parameter;
    String sid = id;
    int start;
    int end = -1;
    parameter = "";
    //if no id it means it is first part of cmd
    if (strlen (id) == 0) {
        start = 0;
    }
    //else find id position
    else {
        start = cmd_params.indexOf (id);
    }
    //if no id found and not first part leave
    if (start == -1 ) {
        return parameter;
    }
    //password and SSID can have space so handle it
    //if no space expected use space as delimiter
    if (!withspace) {
        end = cmd_params.indexOf (" ", start);
    }
    //if no end found - take all
    if (end == -1) {
        end = cmd_params.length();
    }
    //extract parameter
    parameter = cmd_params.substring (start + strlen (id), end);
    //be sure no extra space
    parameter.trim();
    return parameter;
}

//functions
bool execute_internal_command (int cmd, String cmd_params, level_authenticate_type auth_level,  AsyncResponseStream  *espresponse)
{
    bool response = true;
    level_authenticate_type auth_type = auth_level;

    //manage parameters
    String parameter;
    String resp="";
    switch (cmd) {
        //*Get SD Card Status
        //[ESP200]
        case 200:
            {
            ESP_SD card;
            int8_t state = card.card_status();
            if (state == -1)resp="Busy";
            else if (state == 1)resp="SD card detected";
            else resp="No SD card";
            if (espresponse)espresponse->println (resp.c_str());
            }
            break;
            
         case 201:
            {
                ESP_SD card;
                resp ="";
                if (card.openDir(cmd_params)){
                    bool isfile;
                    uint32_t filesize;
                    char name[13];
                    while (card.readDir( name, &filesize, &isfile)){
                    if (resp.length()>0)resp +="\n";
                    resp +=name;
                    resp +=" ";
                    resp +=String(filesize);
                    resp +=" ";
                    resp +=isfile?"File":"Dir";
                    }
                } else resp = "Error opening";
                if (resp.length() == 0)resp="empty";
                if (espresponse)espresponse->println (resp.c_str());
            }
            break;
        //Get full ESP32 wifi settings content
        //[ESP400]
        case 400:
            { 
            String v;
            String defV;
            int8_t vi;
            resp = F("{\"EEPROM\":[");
            ESP_preferences.begin(NAMESPACE, true);
            //1 - Hostname
            resp += F ("{\"F\":\"network\",\"P\":\"");
            resp += HOSTNAME_ENTRY;
            resp += F ("\",\"T\":\"S\",\"V\":\"");
            resp += http_hostname;
            resp += F ("\",\"H\":\"Hostname\" ,\"S\":\"");
            resp += String(MAX_HOSTNAME_LENGTH);
            resp += F ("\", \"M\":\"");
            resp += String(MIN_HOSTNAME_LENGTH);
            resp += F ("\"}");
            resp += F (",");
            
            //2 - http protocol mode
            resp += F ("{\"F\":\"network\",\"P\":\"");
            resp += HTTP_ENABLE_ENTRY;
            resp += F ("\",\"T\":\"B\",\"V\":\"");
            vi = ESP_preferences.getChar(HTTP_ENABLE_ENTRY, 1);
            resp += String(vi);
            resp += F ("\",\"H\":\"HTTP protocol\",\"O\":[{\"Enabled\":\"1\"},{\"Disabled\":\"0\"}]}");
            resp += F (",");
            
