exilaus/E4d-box-project/SW/working firmware/Marlin/src/HAL/HAL_ESP32/http_ESP32.cpp
            //3 - http port
            resp += F ("{\"F\":\"network\",\"P\":\"");
            resp += HTTP_PORT_ENTRY;
            resp += F ("\",\"T\":\"I\",\"V\":\"");
            resp += String(http_port);
            resp += F ("\",\"H\":\"HTTP Port\",\"S\":\"");
            resp += String(MAX_HTTP_PORT);
            resp += F ("\",\"M\":\"");
            resp += String(MIN_HTTP_PORT);
            resp += F ("\"}");
            resp += F (",");
            
            //4 - telnet protocol mode
            resp += F ("{\"F\":\"network\",\"P\":\"");
            resp += TELNET_ENABLE_ENTRY;
            resp += F ("\",\"T\":\"B\",\"V\":\"");
            vi = ESP_preferences.getChar(TELNET_ENABLE_ENTRY, 0);
            resp += String(vi);
            resp += F ("\",\"H\":\"Telnet protocol\",\"O\":[{\"Enabled\":\"1\"},{\"Disabled\":\"0\"}]}");
            resp += F (",");
            
            //5 - telnet Port
            resp += F ("{\"F\":\"network\",\"P\":\"");
            resp += TELNET_PORT_ENTRY;
            resp += F ("\",\"T\":\"I\",\"V\":\"");
            resp += String(data_port);
            resp += F ("\",\"H\":\"Telnet Port\",\"S\":\"");
            resp += String(MAX_TELNET_PORT);
            resp += F ("\",\"M\":\"");
            resp += String(MIN_TELNET_PORT);
            resp += F ("\"}");
            resp += F (",");
            
            //6 - wifi mode
            resp += F ("{\"F\":\"network\",\"P\":\"");
            resp += ESP_WIFI_MODE;
            resp += F ("\",\"T\":\"B\",\"V\":\"");
            vi = ESP_preferences.getChar(ESP_WIFI_MODE, ESP_WIFI_OFF);
            resp += String(vi);
            resp += F ("\",\"H\":\"Wifi mode\",\"O\":[{\"STA\":\"1\"},{\"AP\":\"2\"},{\"None\":\"0\"}]}");
            resp += F (",");

            //7 - STA SSID
            resp += F ("{\"F\":\"network\",\"P\":\"");
            resp += STA_SSID_ENTRY;
            resp += F ("\",\"T\":\"S\",\"V\":\"");
            defV = DEFAULT_STA_SSID;
            resp += ESP_preferences.getString(STA_SSID_ENTRY, defV);
            resp += F ("\",\"S\":\"");
            resp += String(MAX_SSID_LENGTH);
            resp +=  F ("\",\"H\":\"Station SSID\",\"M\":\"");
            resp += String(MIN_SSID_LENGTH);
            resp += F ("\"}");
            resp += F (",");

            //8 - STA password
            resp += F ("{\"F\":\"network\",\"P\":\"");
            resp += STA_PWD_ENTRY;
            resp += F ("\",\"T\":\"S\",\"V\":\"");
            resp += HIDDEN_PASSWORD;
            resp += F ("\",\"S\":\"");
            resp += String(MAX_PASSWORD_LENGTH);
            resp += F ("\",\"H\":\"Station Password\",\"M\":\"");
            resp += String(MIN_PASSWORD_LENGTH);
            resp += F ("\"}");
            resp += F (",");
            
            // 9 - STA IP mode
            resp += F ("{\"F\":\"network\",\"P\":\"");
            resp += STA_IP_MODE_ENTRY;
            resp += F ("\",\"T\":\"B\",\"V\":\"");
            resp += String(ESP_preferences.getChar(STA_IP_MODE_ENTRY, DHCP_MODE));
            resp += F ("\",\"H\":\"Station IP Mode\",\"O\":[{\"DHCP\":\"0\"},{\"Static\":\"1\"}]}");
            resp += F (",");

            //10-STA static IP
            resp += F ("{\"F\":\"network\",\"P\":\"");
            resp += STA_IP_ENTRY;
            resp += F ("\",\"T\":\"A\",\"V\":\"");
            resp += IP_string_from_int(ESP_preferences.getInt(STA_IP_ENTRY, 0));
            resp += F ("\",\"H\":\"Station Static IP\"}");
            resp += F (",");

            //11-STA static Gateway
            resp += F ("{\"F\":\"network\",\"P\":\"");
            resp += STA_GW_ENTRY;
            resp += F ("\",\"T\":\"A\",\"V\":\"");
            resp += IP_string_from_int(ESP_preferences.getInt(STA_GW_ENTRY, 0));
            resp += F ("\",\"H\":\"Station Static Gateway\"}");
            resp += F (",");

            //12-STA static Mask
            resp += F ("{\"F\":\"network\",\"P\":\"");
            resp += STA_MK_ENTRY;
            resp += F ("\",\"T\":\"A\",\"V\":\"");
            resp += IP_string_from_int(ESP_preferences.getInt(STA_MK_ENTRY, 0));
            resp += F ("\",\"H\":\"Station Static Mask\"}");
            resp += F (",");
            
            //13 - AP SSID
            resp += F ("{\"F\":\"network\",\"P\":\"");
            resp += AP_SSID_ENTRY;
            resp += F ("\",\"T\":\"S\",\"V\":\"");
            defV = DEFAULT_AP_SSID;
            resp += ESP_preferences.getString(AP_SSID_ENTRY, defV);
            resp += F ("\",\"S\":\"");
            resp += String(MAX_SSID_LENGTH);
            resp +=  F ("\",\"H\":\"AP SSID\",\"M\":\"");
            resp += String(MIN_SSID_LENGTH);
            resp += F ("\"}");
            resp += F (",");

            //14 - AP password
            resp += F ("{\"F\":\"network\",\"P\":\"");
            resp += AP_PWD_ENTRY;
            resp += F ("\",\"T\":\"S\",\"V\":\"");
            resp += HIDDEN_PASSWORD;
            resp += F ("\",\"S\":\"");
            resp += String(MAX_PASSWORD_LENGTH);
            resp += F ("\",\"H\":\"AP Password\",\"M\":\"");
            resp += String(MIN_PASSWORD_LENGTH);
            resp += F ("\"}");
            resp += F (",");
            
            //15-AP static IP
            resp += F ("{\"F\":\"network\",\"P\":\"");
            resp += AP_IP_ENTRY;
            resp += F ("\",\"T\":\"A\",\"V\":\"");
            defV = DEFAULT_AP_IP;
            resp += IP_string_from_int(ESP_preferences.getInt(AP_IP_ENTRY, IP_int_from_string(defV)));
            resp += F ("\",\"H\":\"AP Static IP\"}");
            resp += F (",");
            
            //20-AP Channel
            resp += F ("{\"F\":\"network\",\"P\":\"");
            resp += AP_CHANNEL_ENTRY;
            resp += F ("\",\"T\":\"B\",\"V\":\"");
            resp += String(ESP_preferences.getChar(AP_CHANNEL_ENTRY, DEFAULT_AP_CHANNEL));
            resp += F ("\",\"H\":\"AP Channel\",\"O\":[");
            for (int i = MIN_CHANNEL; i <= MAX_CHANNEL ; i++) {
                resp += F ("{\"");
                resp += String(i);
                resp += F ("\":\"");
                resp += String(i);
                resp += F ("\"}");
                if (i < MAX_CHANNEL) {
                    resp += F (",");
                }
            }
            resp += F ("]}");
            
            resp += F ("]}");
            ESP_preferences.end();
            if (espresponse)espresponse->println (resp.c_str());
            }
            break;
            //Set EEPROM setting
    //[ESP401]P=<position> T=<type> V=<value> pwd=<user/admin password>
    case 401:    
    {
        //check validity of parameters
        String spos = get_param (cmd_params, "P=", false);
        String styp = get_param (cmd_params, "T=", false);
        String sval = get_param (cmd_params, "V=", true);
        spos.trim();
        sval.trim();
        if (spos.length() == 0) {
            response = false;
        }
        if (! (styp == "B" || styp == "S" || styp == "A" || styp == "I" || styp == "F") ) {
            response = false;
        }
        if (sval.length() == 0) {
            response = false;
        }

