exilaus/E4d-box-project/SW/working firmware/Marlin/src/HAL/HAL_ESP32/http_ESP32.cpp
/*
#ifdef AUTHENTICATION_FEATURE
        if (response) {
            //check authentication
            level_authenticate_type auth_need = LEVEL_ADMIN;
            for (int i = 0; i < AUTH_ENTRY_NB; i++) {
                if (Setting[i][0] == pos ) {
                    auth_need = (level_authenticate_type) (Setting[i][1]);
                    i = AUTH_ENTRY_NB;
                }
            }
            if ( (auth_need == LEVEL_ADMIN && auth_type == LEVEL_USER) || (auth_type == LEVEL_GUEST) ) {
                response = false;
            }
        }
#endif*/
        if (response) {
            ESP_preferences.begin(NAMESPACE, false);
            //Byte value
            if ((styp == "B")  ||  (styp == "F")){
                int8_t bbuf = sval.toInt();
                if (ESP_preferences.putChar(spos.c_str(), bbuf) ==0 ) {
                    response = false;
                } else {
                    //dynamique refresh is better than restart the board
                    if (spos == ESP_WIFI_MODE){
                        //TODO
                    }
                    if (spos == AP_CHANNEL_ENTRY) {
                        //TODO
                    }
                    if (spos == HTTP_ENABLE_ENTRY) {
                        //TODO
                    }
                    if (spos == TELNET_ENABLE_ENTRY) {
                        //TODO
                    }
                }
            }
            //Integer value
            if (styp == "I") {
                int16_t ibuf = sval.toInt();
                if (ESP_preferences.putUShort(spos.c_str(), ibuf) == 0) {
                    response = false;
                } else {
                    if (spos == HTTP_PORT_ENTRY){
                        //TODO
                    }
                    if (spos == TELNET_PORT_ENTRY){
                        //TODO
                        //Serial.println(ibuf);
                    }
                }
                
            }
            //String value
            if (styp == "S") {
               if (ESP_preferences.putString(spos.c_str(), sval) == 0) {
                    response = false;
                } else {
                    if (spos == HOSTNAME_ENTRY){
                        //TODO
                    }
                    if (spos == STA_SSID_ENTRY){
                        //TODO
                    }
                    if (spos == STA_PWD_ENTRY){
                        //TODO
                    }
                    if (spos == AP_SSID_ENTRY){
                        //TODO
                    }
                    if (spos == AP_PWD_ENTRY){
                        //TODO
                    }
                }
                
            }
            //IP address
            if (styp == "A") {
                if (ESP_preferences.putInt(spos.c_str(), IP_int_from_string(sval)) == 0) {
                    response = false;
                } else {
                    if (spos == STA_IP_ENTRY){
                        //TODO
                    }
                    if (spos == STA_GW_ENTRY){
                        //TODO
                    }
                    if (spos == STA_MK_ENTRY){
                        //TODO
                    }
                    if (spos == AP_IP_ENTRY){
                        //TODO
                    }
                }
            }
            ESP_preferences.end();
        }
        if (!response) {
            if (espresponse)espresponse->println ("Error: Incorrect Command");
        } else {
            if (espresponse)espresponse->println ("ok");
        }

    }
    break;
         //Get ESP current status 
        case 420:
            {
            resp = F ("Chip ID: ");
            resp += String ( (uint16_t) (ESP.getEfuseMac() >> 32) );
            resp += F ("\n");
            resp += F ("CPU Frequency: ");
            resp += String (ESP.getCpuFreqMHz() );
            resp += F ("Mhz");
            resp += F ("\n");
            resp += F ("CPU Temperature: ");
            resp += String (temperatureRead(), 1);
            resp += F ("&deg;C");
            resp += F ("\n");
            resp += F ("Free memory: ");
            resp += formatBytes (ESP.getFreeHeap() );
            resp += F ("\n");
            resp += F ("SDK: ");
            resp += ESP.getSdkVersion();
            resp += F ("\n");
            resp += F ("Flash Size: ");
            resp += formatBytes (ESP.getFlashChipSize() );
            resp += F ("\n");
            resp += F ("Available Size for update: ");
            //Not OTA on 2Mb board per spec
            if (ESP.getFlashChipSize() > 0x20000) {
                resp += formatBytes (0x140000);
            } else {
                resp += formatBytes (0x0);
            }
            resp += F ("\n");
            resp += F ("Available Size for SPIFFS: ");
            resp += formatBytes (SPIFFS.totalBytes() );
            resp += F ("\n");
            resp += F ("Baud rate: ");
            long br = MYSERIAL0.baudRate();
            //workaround for ESP32
            if (br == 115201) {
                br = 115200;
            }
            if (br == 230423) {
                br = 230400;
            }
            resp += String(br);
            resp += F ("\n");
            resp += F ("Sleep mode: ");
            if (WiFi.getSleep())resp += F ("Modem");
            else resp += F ("None");
            resp += F ("\n");
            resp += F ("Web port: ");
            resp += String(http_port);
            resp += F ("\n");
            resp += F ("Data port: ");
            if (data_port!=0)resp += String(data_port);
            else resp += F ("Disabled");
            resp += F ("\n");
            resp += F ("Hostname: ");
            resp += http_hostname;
            resp += F ("\n");
            resp += F ("Active Mode: ");
            if (WiFi.getMode() == WIFI_STA) {
                 resp += F ("STA (");
                 resp += WiFi.macAddress();
                 resp += F (")");
                 resp += F ("\n");
                 resp += F ("Connected to: ");
                 if (WiFi.isConnected()){ //in theory no need but ...  
                     resp += WiFi.SSID();
                     resp += F ("\n");
                     resp += F ("Signal: ");
                     resp += String(getSignal (WiFi.RSSI()));
                     resp += F ("%");
                     resp += F ("\n");
                     uint8_t PhyMode;
                     esp_wifi_get_protocol (ESP_IF_WIFI_STA, &PhyMode);
                     resp += F ("Phy Mode: ");
                     if (PhyMode == (WIFI_PROTOCOL_11B | WIFI_PROTOCOL_11G | WIFI_PROTOCOL_11N)) resp += F ("11n");
                     else if (PhyMode == (WIFI_PROTOCOL_11B | WIFI_PROTOCOL_11G)) resp += F ("11g");
                     else if (PhyMode == (WIFI_PROTOCOL_11B )) resp += F ("11b");
                     else resp += F ("???");
                     resp += F ("\n");
                     resp += F ("Channel: ");
                     resp += String (WiFi.channel());
                     resp += F ("\n");
                     resp += F ("IP Mode: ");
                     tcpip_adapter_dhcp_status_t dhcp_status;
                     tcpip_adapter_dhcpc_get_status (TCPIP_ADAPTER_IF_STA, &dhcp_status);
                     if (dhcp_status == TCPIP_ADAPTER_DHCP_STARTED)resp += F ("DHCP");
                     else resp += F ("Static");
                     resp += F ("\n");
                     resp += F ("IP: ");
                     resp += WiFi.localIP().toString();
                     resp += F ("\n");
                     resp += F ("Gateway: ");
                     resp += WiFi.gatewayIP().toString();
                     resp += F ("\n");
                     resp += F ("Mask: ");
                     resp += WiFi.subnetMask().toString();
                     resp += F ("\n");
                     resp += F ("DNS: ");
                     resp += WiFi.dnsIP().toString();
                     resp += F ("\n");
                 } //this is web command so connection => no command 
                 resp += F ("Disabled Mode: ");
                 resp += F ("AP (");
                 resp += WiFi.softAPmacAddress();
                 resp += F (")");
                 resp += F ("\n");
            } else if (WiFi.getMode() == WIFI_AP) {
                 resp += F ("AP (");
                 resp += WiFi.softAPmacAddress();
                 resp += F (")");
                 resp += F ("\n");
                 wifi_config_t conf;
                 esp_wifi_get_config (ESP_IF_WIFI_AP, &conf);
                 resp += F ("SSID: ");
                 resp += (const char*) conf.ap.ssid;
                 resp += F ("\n");
                 resp += F ("Visible: ");
                 resp += (conf.ap.ssid_hidden == 0) ? F ("Yes") : F ("No");
                 resp += F ("\n");
                 resp += F ("Authentication: ");
                 if (conf.ap.authmode == WIFI_AUTH_OPEN) {
                    resp += F ("None");
                 } else if (conf.ap.authmode == WIFI_AUTH_WEP) {
                    resp += F ("WEP");
                 } else if (conf.ap.authmode == WIFI_AUTH_WPA_PSK) {
                    resp += F ("WPA");
                 } else if (conf.ap.authmode == WIFI_AUTH_WPA2_PSK) {
                    resp += F ("WPA2");
                 } else {
                    resp += F ("WPA/WPA2");
                 }
                resp += F ("\n");
                resp += F ("Max Connections: ");
                resp += String(conf.ap.max_connection);
                resp += F ("\n");
                resp += F ("DHCP Server: ");
                tcpip_adapter_dhcp_status_t dhcp_status;
                tcpip_adapter_dhcps_get_status (TCPIP_ADAPTER_IF_AP, &dhcp_status);
                if (dhcp_status == TCPIP_ADAPTER_DHCP_STARTED)resp += F ("Started");
                else resp += F ("Stopped");
                resp += F ("\n");
                resp += F ("IP: ");
                resp += WiFi.softAPIP().toString();
                resp += F ("\n");
                tcpip_adapter_ip_info_t ip_AP;
                tcpip_adapter_get_ip_info (TCPIP_ADAPTER_IF_AP, &ip_AP);
                resp += F ("Gateway: ");
                resp += IPAddress (ip_AP.gw.addr).toString();
                resp += F ("\n");
                resp += F ("Mask: ");
                resp += IPAddress (ip_AP.netmask.addr).toString();
                resp += F ("\n");
                resp += F ("Connected clients: ");
                wifi_sta_list_t station;
                tcpip_adapter_sta_list_t tcpip_sta_list;
                esp_wifi_ap_get_sta_list (&station);
                tcpip_adapter_get_sta_list (&station, &tcpip_sta_list);
                resp += String(station.num);
                resp += F ("\n");
                for (int i = 0; i < station.num; i++) {
                    resp +=  mac2str (tcpip_sta_list.sta[i].mac);
                    resp +=  F (" ");
                    resp +=  IPAddress (tcpip_sta_list.sta[i].ip.addr).toString();
                    resp += F ("\n");
                    }
                resp += F ("Disabled Mode: ");
                resp += F ("STA (");
                resp += WiFi.macAddress();
                resp += F (")");
                resp += F ("\n");
            } else if (WiFi.getMode() == WIFI_AP_STA) //we should not be in this state but just in case ....
            {
               resp += F ("Mixed");
               resp += F ("\n");
               resp += F ("STA (");
               resp += WiFi.macAddress();
               resp += F (")");
               resp += F ("\n");
               resp += F ("AP (");
               resp += WiFi.softAPmacAddress();
               resp += F (")");
               resp += F ("\n");
        
            } else { //we should not be there if no wifi ....
               resp += F ("Wifi Off");
               resp += F ("\n");
            }
            //TODO to complete
            resp += F ("FW version: ");
            resp += SHORT_BUILD_VERSION;
            resp += F (" (ESP32)");
            if (espresponse)espresponse->println (resp.c_str());
            }
            break;
        //get fw version / fw target / hostname / authentication
        //[ESP800]
        case 800: 
            resp = "FW version:";
            resp += SHORT_BUILD_VERSION;
            resp += " # FW target:marlin-embedded  # FW HW:Direct SD  # primary sd:/sd # secondary sd:none # authentication:";
            #ifdef AUTHENTICATION_FEATURE
            resp += "yes";
            #else
            resp += "no";
            #endif
            resp += " # webcommunication: Async # hostname:";
            resp += http_hostname;
            if (WiFi.getMode() == WIFI_AP)resp += "(AP mode)";
            if (espresponse)espresponse->println (resp.c_str());
            break;
        default:
            if (espresponse)espresponse->println ("Error: Incorrect Command");
            response = false;
            break;
    }
    return response;
}

//Handlers

//Not found Page handler
void handle_not_found (AsyncWebServerRequest *request)
{
    //if we are here it means no index.html
    if (request->url() == "/") {
        AsyncWebServerResponse * response = request->beginResponse_P (200, "text/html", PAGE_NOFILES, PAGE_NOFILES_SIZE);
        response->addHeader ("Content-Encoding", "gzip");
        request->send (response);
    } else {
        String path = F ("/404.htm");
        String pathWithGz =  path + F (".gz");
        if (SPIFFS.exists (pathWithGz) || SPIFFS.exists (path) ) {
            request->send (SPIFFS, path);
        } else {
            //if not template use default page
            String contentpage = FPSTR (PAGE_404);
            String stmp;
            if (WiFi.getMode() == WIFI_STA ) {
                stmp = WiFi.localIP().toString();
            } else {
                stmp = WiFi.softAPIP().toString();
            }
            //Web address = ip + port
            String KEY_IP = F ("$WEB_ADDRESS$");
            String KEY_QUERY = F ("$QUERY$");
            if (http_port != 80) {
                stmp += ":";
                stmp += String(http_port);
            }
            contentpage.replace (KEY_IP, stmp);
            contentpage.replace (KEY_QUERY, request->url() );
            request->send (404, "text/html", contentpage.c_str() );
        }
    }
}

//Web Update handler 
void handleUpdate (AsyncWebServerRequest *request)
{
    level_authenticate_type auth_level = is_authenticated();
    if (auth_level != LEVEL_ADMIN) {
        _upload_status = UPLOAD_STATUS_NONE;
        request->send (403, "text/plain", "Not allowed, log in first!\n");
        return;
    }
    String jsonfile = "{\"status\":\"" ;
    jsonfile += String(_upload_status);
    jsonfile += "\"}";
    //send status
    AsyncResponseStream  *response = request->beginResponseStream ("application/json");
    response->addHeader ("Cache-Control", "no-cache");
    response->print (jsonfile.c_str() );
    request->send (response);
    //if success restart
    if (_upload_status == UPLOAD_STATUS_SUCCESSFUL) {
        restart_ESP_module = true;
    } else {
        _upload_status = UPLOAD_STATUS_NONE;
    }
}

//File upload for Web update
void WebUpdateUpload (AsyncWebServerRequest *request, String filename, size_t index, uint8_t *data, size_t len, bool final)
{
    static size_t last_upload_update;
    static size_t totalSize;
    static uint32_t maxSketchSpace ;
    //only admin can update FW
    if (is_authenticated() != LEVEL_ADMIN) {
        _upload_status = UPLOAD_STATUS_CANCELLED;
        request->client()->abort();
        SERIAL_ERROR_START();
        SERIAL_ERRORLNPGM("Upload rejected");
        return;
    }
    //Upload start
    //**************
    if (!index) {
        MYSERIAL0.println (F ("Update Firmware"));
        _upload_status = UPLOAD_STATUS_ONGOING;

        //Not sure can do OTA on 2Mb board if conf file is modified
        maxSketchSpace = (ESP.getFlashChipSize() > 0x20000) ? 0x140000 : 0x140000 / 2;
        last_upload_update = 0;
        totalSize = 0;
        if (!Update.begin (maxSketchSpace) ) { //start with max available size
            _upload_status = UPLOAD_STATUS_CANCELLED;
            SERIAL_ERROR_START();
            SERIAL_ERRORLNPGM("Upload cancelled");
            request->client()->abort();
            return;
        } else {
            MYSERIAL0.println (F ("Update 0%"));
        }
    }
    //Upload write
    //**************
    if (_upload_status == UPLOAD_STATUS_ONGOING) {
        //we do not know the total file size yet but we know the available space so let's use it
        totalSize += len;
        if ( ( (100 * totalSize) / maxSketchSpace) != last_upload_update) {
            last_upload_update = (100 * totalSize) / maxSketchSpace;
            String s = "Update ";
            s+= String(last_upload_update);
            s+="%";
            MYSERIAL0.println (s);
        }
        if (Update.write (data, len) != len) {
            _upload_status = UPLOAD_STATUS_CANCELLED;
            SERIAL_ERROR_START();
            SERIAL_ERRORLNPGM("Upload error");
            Update.end();
            request->client()->abort();
        }
    }
    //Upload end
    //**************
    if (final) {
        String  sizeargname  = filename + "S";
        if (request->hasArg (sizeargname.c_str()) ) {
             if (request->arg (sizeargname.c_str()) != String(totalSize)) {
                 _upload_status = UPLOAD_STATUS_FAILED;
                 SERIAL_ERROR_START();
                 SERIAL_ERRORLNPGM("Upload rejected");
                 Update.end();
                 request->client()->abort();
             }
        }
        if (Update.end (true) ) { //true to set the size to the current progress
            //Update is done
            MYSERIAL0.println (F ("Update 100%"));
            _upload_status = UPLOAD_STATUS_SUCCESSFUL;
        } 
    }
}

//SD File upload with direct access to SD///////////////////////////////
void SDFile_direct_upload(AsyncWebServerRequest *request, String filename, size_t index, uint8_t *data, size_t len, bool final)
{
    //TODO use the tmp obj of the request instead
    static ESP_SD sdfile;
    //Guest cannot upload - only admin
    if (is_authenticated() != LEVEL_ADMIN) {
        _upload_status = UPLOAD_STATUS_CANCELLED;
        request->client()->abort();
        return;
    }
    String upload_filename = filename;
    if (upload_filename[0] != '/') {
        upload_filename = "/" + filename;
    }

    //Upload start
    //**************
    if (!index)
     {
        upload_filename=  sdfile.makepath83(upload_filename);
        if ( sdfile.card_status() != 1) {
            _upload_status=UPLOAD_STATUS_CANCELLED;
            request->client()->abort();
            return;
        }
        if (sdfile.exists (upload_filename.c_str()) ) {
            sdfile.remove (upload_filename.c_str());
        } 
        
        if (sdfile.isopen())sdfile.close();
        if (!sdfile.open (upload_filename.c_str(),false)) {
            request->client()->abort();
            _upload_status = UPLOAD_STATUS_FAILED;
            return ;
        } else {
            _upload_status = UPLOAD_STATUS_ONGOING;
        }
     }
      //Upload write
    //**************
    //we need to check SD is inside
    if ( sdfile.card_status() != 1) {
            sdfile.close();
            request->client()->abort();
            _upload_status = UPLOAD_STATUS_FAILED;
            return;
        }
    if (sdfile.isopen()) {
        if ( (_upload_status = UPLOAD_STATUS_ONGOING) && len) {
            sdfile.write (data, len);
        }
    }
    //Upload end
    //**************
    if(final)
     {
         sdfile.close();
         uint32_t filesize = sdfile.size();
        String  sizeargname  = filename + "S";
        if (request->hasArg (sizeargname.c_str()) ) {
            if (request->arg (sizeargname.c_str()) != String(filesize)) {
                _upload_status = UPLOAD_STATUS_FAILED;
                }
            } 
        if (_upload_status == UPLOAD_STATUS_ONGOING) {
            _upload_status = UPLOAD_STATUS_SUCCESSFUL;
        }
    }
}

