exilaus/E4d-box-project/SW/working firmware/Marlin/src/HAL/HAL_ESP32/http_ESP32.cpp
//direct SD files list//////////////////////////////////////////////////
void handle_direct_SDFileList(AsyncWebServerRequest *request)
{
    //this is only for admin an user
    if (is_authenticated() == LEVEL_GUEST) {
        _upload_status=UPLOAD_STATUS_NONE;
        request->send(401, "application/json", "{\"status\":\"Authentication failed!\"}");
        return;
    }
    

    String path="/";
    String sstatus="Ok";
    if ((_upload_status == UPLOAD_STATUS_FAILED) || (_upload_status == UPLOAD_STATUS_CANCELLED)) {
        sstatus = "Upload failed";
        _upload_status = UPLOAD_STATUS_NONE;
    }
    bool list_files = true;
    ESP_SD card;
    int8_t state = card.card_status();
    if (state != 1){
        request->send(200, "application/json", "{\"status\":\"No SD Card\"}");
        return;
    }

    //get current path
    if(request->hasArg("path")) {
        path += request->arg("path") ;
    }
    //to have a clean path
    path.trim();
    path.replace("//","/");
    
    //check if query need some action
    if(request->hasArg("action")) {
        //delete a file
        if(request->arg("action") == "delete" && request->hasArg("filename")) {
            String filename;
            String shortname = request->arg("filename");
            filename = path + shortname;
            shortname.replace("/","");
            filename.replace("//","/");
            
            if(!card.exists(filename.c_str())) {
                sstatus = shortname + F(" does not exist!");
            } else {
                if (card.remove(filename.c_str())) {
                    sstatus = shortname + F(" deleted");
                } else {
                    sstatus = F("Cannot deleted ") ;
                    sstatus+=shortname ;
                }
            }
        }
        //delete a directory
        if( request->arg("action") == "deletedir" &&  request->hasArg("filename")) {
            String filename;
            String shortname = request->arg("filename");
            shortname.replace("/","");
            filename = path + "/" + shortname;
            filename.replace("//","/");
            if (filename != "/") {
                if(!card.dir_exists(filename.c_str())) {
                    sstatus = shortname + F(" does not exist!");
                } else {
                    if (!card.rmdir(filename.c_str())) {
                        sstatus ="Error deleting: ";
                        sstatus += shortname ;
                    } else {
                        sstatus = shortname ;
                        sstatus+=" deleted";
                    }
                }
            } else {
                sstatus ="Cannot delete root";
            }
        }
        //create a directory
        if( request->arg("action")=="createdir" &&  request->hasArg("filename")) {
            String filename;
            String shortname =  request->arg("filename"); 
            filename = path + shortname;
            shortname.replace("/","");
            filename.replace("//","/");
            if(card.exists(filename.c_str())) {
                sstatus = shortname + F(" already exists!");
            } else {
                if (!card.mkdir(filename.c_str())) {
                    sstatus = F("Cannot create ");
                    sstatus += shortname ;
                } else {
                    sstatus = shortname + F(" created");
                }
            }
        }  
    }
  
    //check if no need build file list
    if( request->hasArg("dontlist")) {
        if( request->arg("dontlist") == "yes") {
            list_files = false;
        }
    }
    String jsonfile = "{" ;
    jsonfile+="\"files\":[";
    if (!card.openDir(path)){
        String s =  "{\"status\":\" ";
        s += path;
        s+=  " does not exist on SD Card\"}";
        request->send(200, "application/json", s.c_str());
        return;
    }
    if (list_files) {
        char name[13];
        uint32_t size;
        bool isFile;
        uint i = 0;
        while (card.readDir(name,&size ,&isFile)) {
            if (i>0) {
                jsonfile+=",";
            }
            jsonfile+="{\"name\":\"";
            jsonfile+=name;
            jsonfile+="\",\"shortname\":\"";
            jsonfile+=name;
            jsonfile+="\",\"size\":\"";
            if (isFile)jsonfile+=formatBytes(size);
            else jsonfile+="-1";
            jsonfile+="\",\"datetime\":\""; 
            //TODO datatime
            jsonfile+="\"}";
            i++;
            ESP_wait (1);
        }
        jsonfile+="],\"path\":\"";
        jsonfile+=path + "\",";
    }
    static uint32_t volTotal = card.card_total_space();
    static uint32_t volUsed = card.card_used_space();;
    //TODO 
    //Get right values
    uint32_t  occupedspace = (volUsed/volTotal)*100;
    jsonfile+="\"total\":\"";
    if ( (occupedspace <= 1) && (volTotal!=volUsed)) {
            occupedspace=1;
        }
    jsonfile+= formatBytes(volTotal); ;
    
    jsonfile+="\",\"used\":\"";
    jsonfile+= formatBytes(volUsed); ;
    jsonfile+="\",\"occupation\":\"";
    jsonfile+=String(occupedspace);
    jsonfile+= "\",";

    jsonfile+= "\"mode\":\"direct\",";
    jsonfile+= "\"status\":\"";
    jsonfile+=sstatus + "\"";
    jsonfile+= "}";
    
    AsyncResponseStream  *response = request->beginResponseStream ("application/json");
    response->addHeader ("Cache-Control", "no-cache");
    response->print (jsonfile.c_str() );
    request->send (response);
    _upload_status=UPLOAD_STATUS_NONE;
}

//direct SD Content
void handle_SDCARD(AsyncWebServerRequest *request)
{
    String filepath=request->url();
    request->_tempObject = new ESP_SD;
    //in case of disconnection
    request->onDisconnect([request](){
            if(request->_tempObject) delete  ((ESP_SD *)(request->_tempObject));
            request->_tempObject = NULL;
        });
    bool file_exists=false;
    filepath.replace("/SD", "");
    if (((ESP_SD *)(request->_tempObject))->exists (filepath.c_str())){
        if (((ESP_SD *)(request->_tempObject))->open(filepath.c_str())){
               
               String ContentType = getContentType(filepath);
               AsyncWebServerResponse *response = request->beginResponse (ContentType.c_str(),  ((ESP_SD *)(request->_tempObject))->size(), [request](uint8_t *buffer, size_t maxLen, size_t index) -> size_t {
                                                       //better to chop for long download
                                                       size_t packetsize = (maxLen > 1200)?1200:maxLen;
                                                       size_t readsize = 0;
                                                       readsize = ((ESP_SD *)request->_tempObject)->read(buffer, packetsize);
                                                       if((index + readsize) >= (((ESP_SD *)request->_tempObject)->size())){
                                                        //close file
                                                       ((ESP_SD *)request->_tempObject)->close();
                                                       delete ((ESP_SD *)(request->_tempObject));
                                                       request->_tempObject = NULL;     
                                                      }
                                                      return readsize;
                                                    });
            response->addHeader ("Cache-Control", "no-cache");
            request->send (response);
            file_exists=true;
        } 
    } 
        
   if (!file_exists) {
       handle_not_found(request);
       delete ((ESP_SD *)(request->_tempObject));
       request->_tempObject = NULL;
    }
}


//http SSDP xml presentation
void handle_SSDP (AsyncWebServerRequest *request)
{
    StreamString sschema ;
    if (sschema.reserve (1024) ) {
        String templ =  "<?xml version=\"1.0\"?>"
                        "<root xmlns=\"urn:schemas-upnp-org:device-1-0\">"
                        "<specVersion>"
                        "<major>1</major>"
                        "<minor>0</minor>"
                        "</specVersion>"
                        "<URLBase>http://%s:%u/</URLBase>"
                        "<device>"
                        "<deviceType>upnp:rootdevice</deviceType>"
                        "<friendlyName>%s</friendlyName>"
                        "<presentationURL>/</presentationURL>"
                        "<serialNumber>%s</serialNumber>"
                        "<modelName>ESP32</modelName>"
                        "<modelNumber>Marlin</modelNumber>"
                        "<modelURL>http://espressif.com/en/products/hardware/esp-wroom-32/overview</modelURL>"
                        "<manufacturer>Espressif Systems</manufacturer>"
                        "<manufacturerURL>http://espressif.com</manufacturerURL>"
                        "<UDN>uuid:%s</UDN>"
                        "</device>"
                        "</root>\r\n"
                        "\r\n";
        char uuid[37];
        String sip = WiFi.localIP().toString();
        uint32_t chipId = (uint16_t) (ESP.getEfuseMac() >> 32);
        sprintf (uuid, "38323636-4558-4dda-9188-cda0e6%02x%02x%02x",
                 (uint16_t) ( (chipId >> 16) & 0xff),
                 (uint16_t) ( (chipId >>  8) & 0xff),
                 (uint16_t)   chipId        & 0xff  );
        String serialNumber = String (chipId);
        sschema.printf (templ.c_str(),
                        sip.c_str(),
                        http_port,
                        http_hostname.c_str(),
                        serialNumber.c_str(),
                        uuid);
        request->send (200, "text/xml", (String) sschema);
    } else {
        request->send (500);
    }
}

//login status check 
void handle_login(AsyncWebServerRequest *request)
{
#ifdef AUTHENTICATION_FEATURE
#else
	AsyncWebServerResponse * response = request->beginResponse (200, "application/json", "{\"status\":\"Ok\",\"authentication_lvl\":\"admin\"}");
	response->addHeader("Cache-Control","no-cache");
    request->send(response);
#endif
}

//filter to intercept command line on root
bool filterOnRoot (AsyncWebServerRequest *request)
{
    if (request->hasArg ("forcefallback") ) {
        String stmp = request->arg ("forcefallback");
        //to use all case
        stmp.toLowerCase();
        if ( stmp == "yes") {
            return false;
        }
    }
    return true;
}

