exilaus/E4d-box-project/SW/working firmware/Marlin/src/HAL/HAL_ESP32/http_ESP32.cpp
    }
    //Upload write
    //**************
    if ( request->_tempFile) {
        if ( (_upload_status = UPLOAD_STATUS_ONGOING) && len) {
            request->_tempFile.write (data, len);
        }
    }
    //Upload end
    //**************
    if (final) {
        request->_tempFile.flush();
        request->_tempFile.close();
        request->_tempFile = SPIFFS.open (upload_filename, FILE_READ);
        uint32_t filesize = request->_tempFile.size();
        request->_tempFile.close();
        String  sizeargname  = filename + "S";
        if (request->hasArg (sizeargname.c_str()) ) {
            if (request->arg (sizeargname.c_str()) != String(filesize)) {
                _upload_status = UPLOAD_STATUS_FAILED;
                SPIFFS.remove (upload_filename);
                }
            } 
        if (_upload_status == UPLOAD_STATUS_ONGOING) {
            _upload_status = UPLOAD_STATUS_SUCCESSFUL;
        }
    }
}


//Handle web command query and send answer//////////////////////////////
void handle_web_command (AsyncWebServerRequest *request)
{
     //to save time if already disconnected
     if (request->hasArg ("PAGEID") ) {
        if (request->arg ("PAGEID").length() > 0 ) {
           if (request->arg ("PAGEID").toInt() != id_connection) {
           request->send (200, "text/plain", "Invalid command");
           return;
           }
        }
    }
    level_authenticate_type auth_level = is_authenticated();
    String cmd = "";
    if (request->hasArg ("plain") || request->hasArg ("commandText") ) {
        if (request->hasArg ("plain") ) {
            cmd = request->arg ("plain");
        } else {
            cmd = request->arg ("commandText");
        }
    } else {
        request->send (200, "text/plain", "Invalid command");
        return;
    }
    //if it is internal command [ESPXXX]<parameter>
    cmd.trim();
    int ESPpos = cmd.indexOf ("[ESP");
    if (ESPpos > -1) {
        //is there the second part?
        int ESPpos2 = cmd.indexOf ("]", ESPpos);
        if (ESPpos2 > -1) {
            //Split in command and parameters
            String cmd_part1 = cmd.substring (ESPpos + 4, ESPpos2);
            String cmd_part2 = "";
            //only [ESP800] is allowed login free if authentication is enabled
            if ( (auth_level == LEVEL_GUEST)  && (cmd_part1.toInt() != 800) ) {
                request->send (401, "text/plain", "Authentication failed!\n");
                return;
            }
            //is there space for parameters?
            if (ESPpos2 < cmd.length() ) {
                cmd_part2 = cmd.substring (ESPpos2 + 1);
            }
            //if command is a valid number then execute command
            if (cmd_part1.toInt() != 0) {
                AsyncResponseStream  *response = request->beginResponseStream ("text/html");
                response->addHeader ("Cache-Control", "no-cache");
                //commmand is web only 
                execute_internal_command (cmd_part1.toInt(), cmd_part2, auth_level, response);
                request->send (response);
            }
            //if not is not a valid [ESPXXX] command
        }
    } else { //execute GCODE
        if (auth_level == LEVEL_GUEST) {
            request->send (401, "text/plain", "Authentication failed!\n");
            return;
        }
        //Instead of send several commands one by one by web  / send full set and split here
        String scmd;
        uint8_t sindex = 0;
        scmd = get_Splited_Value(cmd,'\n', sindex);
        while ( scmd !="" ){
        enqueue_and_echo_command(scmd.c_str());
        sindex++;
        scmd = get_Splited_Value(cmd,'\n', sindex);
        }
        request->send (200, "text/plain", "ok");
    }
}


//Handle web command query and send answer//////////////////////////////
void handle_web_command_silent (AsyncWebServerRequest *request)
{
     //to save time if already disconnected
     if (request->hasArg ("PAGEID") ) {
        if (request->arg ("PAGEID").length() > 0 ) {
           if (request->arg ("PAGEID").toInt() != id_connection) {
           request->send (200, "text/plain", "Invalid command");
           return;
           }
        }
    }
    level_authenticate_type auth_level = is_authenticated();
    String cmd = "";
    if (request->hasArg ("plain") || request->hasArg ("commandText") ) {
        if (request->hasArg ("plain") ) {
            cmd = request->arg ("plain");
        } else {
            cmd = request->arg ("commandText");
        }
    } else {
        request->send (200, "text/plain", "Invalid command");
        return;
    }
    //if it is internal command [ESPXXX]<parameter>
    cmd.trim();
    int ESPpos = cmd.indexOf ("[ESP");
    if (ESPpos > -1) {
        //is there the second part?
        int ESPpos2 = cmd.indexOf ("]", ESPpos);
        if (ESPpos2 > -1) {
            //Split in command and parameters
            String cmd_part1 = cmd.substring (ESPpos + 4, ESPpos2);
            String cmd_part2 = "";
            //only [ESP800] is allowed login free if authentication is enabled
            if ( (auth_level == LEVEL_GUEST)  && (cmd_part1.toInt() != 800) ) {
                request->send (401, "text/plain", "Authentication failed!\n");
                return;
            }
            //is there space for parameters?
            if (ESPpos2 < cmd.length() ) {
                cmd_part2 = cmd.substring (ESPpos2 + 1);
            }
            //if command is a valid number then execute command
            if (cmd_part1.toInt() != 0) {
                //commmand is web only 
                execute_internal_command (cmd_part1.toInt(), cmd_part2, auth_level, NULL);
                request->send (200, "text/plain", "ok");
            }
            //if not is not a valid [ESPXXX] command
        }
    } else { //execute GCODE
        if (auth_level == LEVEL_GUEST) {
            request->send (401, "text/plain", "Authentication failed!\n");
            return;
        }
        //Instead of send several commands one by one by web  / send full set and split here
        String scmd;
        uint8_t sindex = 0;
        scmd = get_Splited_Value(cmd,'\n', sindex);
        while ( scmd !="" ){
        enqueue_and_echo_command(scmd.c_str());
        sindex++;
        scmd = get_Splited_Value(cmd,'\n', sindex);
        }
        request->send (200, "text/plain", "ok");
    }
}



//on event connect function
void handle_onevent_connect(AsyncEventSourceClient *client) 
{       
        if (!client->lastId()){
            //Init active ID
            id_connection++;
            client->send(String(id_connection).c_str(), "InitID", id_connection, 1000);
            //Dispatch who is active ID
            web_events->send( String(id_connection).c_str(),"ActiveID");        
            }
}

