exilaus/E4d-box-project/SW/working firmware/Marlin/src/HAL/HAL_ESP32/http_ESP32.cpp
void handle_Websocket_Event(AsyncWebSocket * server, AsyncWebSocketClient * client, AwsEventType type, void * arg, uint8_t *data, size_t len){
  //Handle WebSocket event
}

//Start http function
void http_start(){
   ESP_preferences.begin(NAMESPACE, true);
   int8_t penabled = ESP_preferences.getChar(HTTP_ENABLE_ENTRY, 0);
   //Get http port
   http_port = ESP_preferences.getUShort(HTTP_PORT_ENTRY, DEFAULT_WEBSERVER_PORT);
   //Get hostname
   String defV = DEFAULT_HOSTNAME;
   ESP_preferences.begin(NAMESPACE, true);
   http_hostname = ESP_preferences.getString(HOSTNAME_ENTRY, defV);
   ESP_preferences.end();
   if (penabled == 0) return;
   //create instance
   webserver= new AsyncWebServer(http_port);
   //add mDNS
   MDNS.addService("http","tcp",http_port);
   
   web_events = new AsyncEventSource("/events");
   web_socket = new AsyncWebSocket("/ws");
   Serial2Socket.attachWS(web_socket);
    
   //Web server handlers
   //trick to catch command line on "/" before file being processed
   webserver->serveStatic ("/", SPIFFS, "/").setDefaultFile ("index.html").setFilter (filterOnRoot);
   webserver->serveStatic ("/", SPIFFS, "/Nowhere");
    
   //Page not found handler
   webserver->onNotFound (handle_not_found);
   
   //SSDP service presentation
   webserver->on ("/description.xml", HTTP_GET, handle_SSDP);
   
   //need to be there even no authentication to say to UI no authentication
   webserver->on("/login", HTTP_ANY, handle_login);
   
   //SPIFFS
   webserver->on ("/files", HTTP_ANY, handleFileList, SPIFFSFileupload);
   
   //web update
   webserver->on ("/updatefw", HTTP_ANY, handleUpdate, WebUpdateUpload);
   
   //web commands
   webserver->on ("/command", HTTP_ANY, handle_web_command);
   webserver->on ("/command_silent", HTTP_ANY, handle_web_command_silent);
    
   //Direct SD management
    webserver->on("/upload", HTTP_ANY, handle_direct_SDFileList,SDFile_direct_upload);
    webserver->on("/SD", HTTP_ANY, handle_SDCARD);
    
    //events functions
    web_events->onConnect(handle_onevent_connect);
    //events management
    webserver->addHandler(web_events);

    //Websocket function
    web_socket->onEvent(handle_Websocket_Event);
    //Websocket management
    webserver->addHandler(web_socket);
   
   //Add specific for SSDP
   SSDP.setSchemaURL ("description.xml");
   SSDP.setHTTPPort (http_port);
   SSDP.setName (http_hostname);
   SSDP.setURL ("/");
   SSDP.setDeviceType ("upnp:rootdevice");
    /*Any customization could be here
    SSDP.setModelName (ESP32_MODEL_NAME);
    SSDP.setModelURL (ESP32_MODEL_URL);
    SSDP.setModelNumber (ESP_MODEL_NUMBER);
    SSDP.setManufacturer (ESP_MANUFACTURER_NAME);
    SSDP.setManufacturerURL (ESP_MANUFACTURER_URL);
    */
        
    //Start SSDP
    if (WiFi.getMode() != WIFI_AP ) {
        MYSERIAL0.println("SSDP Started");
        SSDP.begin();
    }
    MYSERIAL0.println("HTTP Started");
#if NUM_SERIAL > 1
   MYSERIAL1.println("HTTP Started");
#endif 
   //start webserver
   webserver->begin();

}

//stop http function
void http_stop(){
    if (webserver) {
        
        webserver->reset();
        delete webserver;
        }
    webserver = NULL;
    if (web_events){
        web_events->close();
        delete web_events;
    }
    web_events = NULL;
    if (web_socket){
        Serial2Socket.detachWS();
        web_socket->closeAll();
        delete web_socket;
    }
    web_socket = NULL;
    //TODO what about mDNS service on http port?
    
}



#endif // WIFISUPPORT

#endif // ARDUINO_ARCH_ESP32
